source/_posts/2013-08-29-emacs-ruby-if-else-intdent.html
---
title: "Emacs 自動縮進 Ruby's if-else"
date: 2013-08-29
layout: post
categories: emacs ruby
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
當我打完 elsif 時，他應該要縮進到 if 那邊。
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">if</span>
   <span style="color: #859900; font-weight: bold;">elsif</span> <span style="color: #586e75;"># </span><span style="color: #586e75;">Should indent this line</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<p>
<!-- more -->
</p>

<p>
正確的 if-else 縮進：
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">if</span> 1&gt;2
  ....
<span style="color: #859900; font-weight: bold;">elsif</span>
  ...
<span style="color: #859900; font-weight: bold;">else</span>
  ...
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<p>
很明顯 else 和 elsif 是向 if 對齊縮進的。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Solution</h2>
<div class="outline-text-2" id="text-2">
<p>
發現在 Emacs 上沒有自動縮進 Ruby 的 if-else 語法後，去試了一下 vim 發現可以處理 if-else
的縮進，當然得跟上！
</p>

<p>
最簡單的方法就是在按 <code>space</code> 時，檢查前一個 word 是不是 <code>else</code> 或 <code>elsif</code> 。
</p>

<p>
首先我有用 ruby-electric，這東西會在你打 <code>if</code> 或 <code>class</code> 等等 自動產生一個 <code>end</code>
在下行，他是依據你打 <code>if&lt;space&gt;</code> 的 <code>&lt;space&gt;</code> 時會觸發產生一個 <code>end</code> 。
</p>

<p>
<code>&lt;space&gt;</code> 對應到 ruby-electric-space 這個 funciton，我從 ruby-electric 裡複製過來，很像不應該這樣做，不過不管了。
</p>

<p>
以下是修改過後的版本：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">ruby-electric-space</span> (arg)
  (interactive <span style="color: #2aa198;">"P"</span>)
  (self-insert-command (prefix-numeric-value arg))
  (<span style="color: #859900; font-weight: bold;">cond</span> ((ruby-electric-space-can-be-expanded-p)
         (<span style="color: #859900; font-weight: bold;">save-excursion</span>
           (ruby-indent-line t)
           (newline)
           (ruby-electric-insert-end)))
        ((ruby-electric-space-can-be-indent-p) (ruby-indent-line t))))

(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">ruby-electric-space-can-be-indent-p</span> ()
  (and (ruby-electric-code-at-point-p)
       (ruby-electric-matching-word-p)))

(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">ruby-electric-matching-word-p</span> ()
  (<span style="color: #859900; font-weight: bold;">save-excursion</span>
    (backward-word)
    (string-match <span style="color: #2aa198;">"</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">(</span><span style="color: #2aa198;">\\&lt;else\\&gt;</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">\\&lt;elsif\\&gt;</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">)</span><span style="color: #2aa198;">"</span> (current-word))))
</pre>
</div>
</div>
</div>
